---
kind: method
id: M:Autodesk.Revit.DB.PlanTopology.GetRoomIds
source: html/b94486f2-f0ae-a2fe-d23a-bab761d60835.htm
---
# Autodesk.Revit.DB.PlanTopology.GetRoomIds Method

Retrieves room ElementIds of the PlanTopology in the last phase.

## Syntax (C#)
```csharp
public ICollection<ElementId> GetRoomIds()
```

## Returns
The PlanTopology Room ElementIds of the last phase.

## Remarks
The Rooms Ids returned are in the phase of PlanTopology and the current design option.